# import pandas

In [2]:
import pandas as pd

# pandas series

In [3]:
ser = pd.Series(data=[100,200,300,500],index=['a','b','c','d'])
print(ser)

a    100
b    200
c    300
d    500
dtype: int64

In [4]:
ser_2 = pd.Series([100,200,500,900],['a','b','c','d'])
print(ser_2)

a    100
b    200
c    500
d    900
dtype: int64

In [5]:
print(ser.index)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [6]:
print(ser['a'])

100

In [7]:
print(ser[['a','b','c']])

a    100
b    200
c    300
dtype: int64

In [8]:
print(ser.loc['a'])

100

In [9]:
print(ser[[0,1,2]])

a    100
b    200
c    300
dtype: int64

In [10]:
print(ser.iloc[[0,1,2]])

a    100
b    200
c    300
dtype: int64

In [11]:
b = 'a' in ser
b

True

In [12]:
'g' in ser

False

# Airthmatic opertions

In [13]:
ser_3 = ser * 2
ser_3

a     200
b     400
c     600
d    1000
dtype: int64

In [14]:
ser_3 = ser ** 2
ser_3

a     10000
b     40000
c     90000
d    250000
dtype: int64

In [15]:
ser_3 = ser / 2
ser_3

a     50.0
b    100.0
c    150.0
d    250.0
dtype: float64

# DataFrame

key:object pair like dictionary ,

but here the objects are series

In [18]:
d = {'one':pd.Series([100,200],index = ['a','b']),
      'two':pd.Series([100,400],index = ['a','b'])}

now we have dictionary we have to make it data frame so

In [19]:
df = pd.DataFrame(d)
print(df)

   one  two
a  100  100
b  200  400

In [50]:
print(df.index)
print(df.columns)

Index(['a', 'b', 'c'], dtype='object')
Index(['one', 'two'], dtype='object')

# data frame using dictionary in list

In [20]:
data = [{'a':100,'b':200,'c':400},{'a':200,'b':899,'c':67},{'a':0,'b':65,'c':99}]

[{'a': 100, 'b': 200, 'c': 400},
 {'a': 200, 'b': 899, 'c': 67},
 {'a': 0, 'b': 65, 'c': 99}]

In [61]:
pd.DataFrame(data,index=['an','bn','cn'])

      a    b    c
an  100  200  400
bn  200  899   67
cn    0   65   99

In [63]:
pd.DataFrame(data,columns = ['a'])

     a
0  100
1  200
2    0

# basic DataFrame Operations

In [22]:
data = pd.DataFrame(data,index=['an','bn','cn'])
data

      a    b    c
an  100  200  400
bn  200  899   67
cn    0   65   99

In [23]:
data['a']

an    100
bn    200
cn      0
Name: a, dtype: int64

In [24]:
data[['a','b']]

      a    b
an  100  200
bn  200  899
cn    0   65

In [25]:
data['sum'] = data['a']+data['b']+data['c']
data

      a    b    c   sum
an  100  200  400   700
bn  200  899   67  1166
cn    0   65   99   164

In [26]:
data['bool'] = data['a']>150
data

      a    b    c   sum   bool
an  100  200  400   700  False
bn  200  899   67  1166   True
cn    0   65   99   164  False

In [27]:
b_2 = data.pop('bool')
b_2
data

      a    b    c   sum
an  100  200  400   700
bn  200  899   67  1166
cn    0   65   99   164

In [28]:
del data['sum']
data

      a    b    c
an  100  200  400
bn  200  899   67
cn    0   65   99

In [29]:
data.insert(2,'copy_from_ne',data['a'])
data

      a    b  copy_from_ne    c
an  100  200           100  400
bn  200  899           200   67
cn    0   65             0   99

In [30]:
del data['copy_from_ne']
data

      a    b    c
an  100  200  400
bn  200  899   67
cn    0   65   99

In [31]:
data

      a    b    c
an  100  200  400
bn  200  899   67
cn    0   65   99

In [32]:
data['copy_from_one_by_second_teh'] = data['a'][:2]
data

      a    b    c  copy_from_one_by_second_teh
an  100  200  400                        100.0
bn  200  899   67                        200.0
cn    0   65   99                          NaN

In [98]:
del data['copy_from_one_by_second_teh']

In [33]:
data

      a    b    c  copy_from_one_by_second_teh
an  100  200  400                        100.0
bn  200  899   67                        200.0
cn    0   65   99                          NaN